{"intents": [
    {"tag": "greeting",
     "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day"],
     "responses": ["Hello", "Good to see you again", "Hi there, how can I help?"],
     "context": [""]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
     "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
     "context": [""]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
     "responses": ["My pleasure", "You're Welcome"],
     "context": [""]
    },
    

    {"tag": "query",
     "patterns": [" What is dehydration?","I am suffering from dehydration", "What are the symptoms of dehydration"," What are the remedies for dehydration?","What are the treatment for dehydration."],
     "responses": ["Dehydration occurs when your body loses more fluid than you take in.When the normal water content of your body is reduced , it upsets the balance of minerals (salts and sugar) in your body, which affects the way it functions. Water makes up over two-thirds of the healthy human body. It lubricates the joints and eyes, aids digestion, flushes out waste and toxins, and keeps the skin healthy.If you’re dehydrated, drink plenty of fluids such as water, diluted squash or fruit juice. These are much more effective than large amounts of tea or coffee. Fizzy drinks may contain more sugar than you need and may be harder to take in large amounts.If you’re finding it difficult to keep water down because you’re vomiting, try drinking small amounts more frequently.Infants and small children who are dehydrated shouldn’t be given large amounts of water alone as the main replacement fluid. This is because it can dilute the already low level of minerals in their body too much and lead to other problems.Dehydration is usually caused by not drinking enough fluid to replace what we lose.The climate, the amount of physical exercise you are doing (particularly in hot weather) and your diet can contribute to dehydration. "],
     "context": [""]
    }, 
    {"tag": "query",
     "patterns": ["What is a mouth ulcer","I have a mouth ulcer","I am suffering from red colour,swollen sore","I am feeling swollen sore","What are the remedies for mouth ulcer","What are the symptoms for mouth ulcers","What should I do for mouth ulcer","How can I cure mouth ulcer" ],
     "responses": ["Mouth ulcers are usually round or oval sores that commonly appear inside the mouth on the cheeks, lips, tongue. They can be white, red, yellow or grey in colour and swollen.You may have more than one mouth ulcer at a time and they may spread or grow.Mouth ulcers shouldn’t be confused with cold sores, which are small blisters that develop on the lips or around the mouth. Cold sores often begin with a tingling, itching or burning sensation around your mouth.If you have a dental problem you should always phone your dentist first. If you are not registered with any dental practice then you should read our advice on dental emergencies.Your pharmacist may advise that you see your GP or dentist if your mouth ulcer has lasted 3 weeks you keep getting mouth ulcers the mouth ulcer grows bigger than usual or is near the back of your throat your mouth ulcer becomes more painful or red – this could be a sign of a bacterial infection, which may need treatment with antibiotics Mouth ulcers are also a possible symptom of hand, foot and mouth disease. Speak to your GP or phone 111 if you’re unsure.Most mouth ulcers clear up by themselves within 1 to 2 weeks without treatment.However, treatment can help to reduce swelling and ease any discomfort. This may help if you keep getting mouth ulcers or your mouth ulcer affects eating and drinking.There are things you can do to speed up healing use a soft toothbrush to brush your teeth ,drink cool drinks through a straw ,eat softer foods ,get regular dental check-ups, eat a healthy, balanced diet ,try to reduce stress and anxiety .Possible treatments include:steroid mouth spray or steroid tablets that dissolve in your mouth .painkilling gels,ointments, sprays or tablets mouthwashes to kill or remove any germs in your mouth Most single mouth ulcers are caused by damage to the lining inside of the mouth. For example:accidentally biting the inside of your cheek or a sharp tooth poorly fitting dentures hard food a faulty filling"],
     "context": [""]
    }, 
    {"tag": "query",
     "patterns": ["What is nosebleed","I am suffering from nosebleeding","I am feeling that blood is coming from my nose","What are the remedies for nosebleeding","What should I do for nosebleeding","How can I treat nosebleeding"],
     "responses": ["During a nosebleed, blood flows from one or both nostrils. It can be heavy or light. It can last from a few seconds to 15 minutes or more.To stop a nosebleed,sit down at a table, lean forward and firmly pinch the soft part of your nose, just above your nostrils, for at least 10 to 15 minutes,place an ice pack or bag of frozen vegetables covered by a towel on your forehead or back of your neck,stay upright or seated, rather than lying down, as this reduces the blood pressure in the blood vessels of your nose and will help reduce further bleeding,Go to your nearest accident and emergency (A&E) or phone 999 if the bleeding continues for longer than 20 minutes the bleeding is heavy and you have  lost a lot of blood,you are having difficulty breathing, you swallow a large amount of blood that makes you vomit "],
     "context": [""]
    },
    {"tag": "query",
     "patterns": ["What is obesity","I have obesity","I am suffering from obesity","I am feeling obesed","What are the remedies for treating obesity","What are the symptoms for obesity","What should I do for obesity","How can I cure obesity"],
     "responses": ["The term obese describes a person who is very overweight, with a lot of body fat.It’s very important to take steps to tackle obesity because, as well as causing obvious physical changes, it can lead to a number of serious and potentially life-threatening conditions, such as type 2 diabetes,bowel cancer,breast cancer.Obesity is generally caused by consuming more calories  particularly those in fatty and sugary foods  than you burn off through physical activity. The excess energy is stored by the body as fat.The best way to treat obesity is to eat a healthy, reduced-calorie diet and exercise regularly. To do this you should eat a balanced, calorie-controlled diet as recommended by your GP or weight loss management health professional (such as a dietitian).You may also benefit from receiving psychological support from a trained healthcare professional to help change the way you think about food and eating.Day-to-day problems related to obesity include increased sweating, snoring difficulty doing physical activity often feeling very tired ,joint and back pain"],
     "context": [""]
    }, 
     {"tag": "query",
     "patterns": ["What is OCD","I have OCD","I am suffering from OCD","What are the treatment for OCD","What are the symptoms for OCD","What should I do for OCD","How can I cure OCD"],
     "responses": ["Obsessive compulsive disorder (OCD) is a mental health condition. It causes a person to have obsessive thoughts and carry out compulsive activity.This can be distressing and can have a big impact on your life. Treatment can help you keep it under control.f you have persistent and unwanted thoughts that dominates your thinking, you may have developed an obsession.Some common obsessions that affect people with OCD include fear of deliberately harming yourself or others – for example, fear you may attack someone else, even though this type of behaviour disgusts you fear of harming yourself or others by mistake or accident – for example, fear you may set the house on fire by accidentally leaving the cooker on fear of contamination by disease, infection or an unpleasant substance "],
     "context": [""]
    }, 
    {"tag": "query",
     "patterns": ["What is pneumonia","I have pneumonia","I am suffering from pneumonia","What are the treatment for pneumonia ","What are the symptoms for pneumonia","What should I do for pneumonia","How can I cure pneumonia"],
     "responses": ["Pneumonia is swelling (inflammation) of the tissue in one or both lungs. It is usually caused by a bacterial infection.At the end of the breathing tubes in your lungs are clusters of tiny air sacs. If you have pneumonia, these tiny sacs become inflamed and fill up with fluid.Common symptoms of pneumonia include a cough – which may be dry, or produce thick yellow, green, brown or blood-stained mucus.your breathing may be rapid and shallow, and you may feel breathless, even when resting.rapid heartbeat ,fever ,feeling generally unwell. "],
     "context": [""]
    }, 
    {"tag": "query",
     "patterns": ["What is a ringworm and fungal infection","I have a ringworm","I am suffering from a fungal infection named ringworm","What are the treatment for ringworm","What are the symptoms for ringworm","What should I do for ringworm","How can I cure ringworm"],
     "responses": ["Ringworm is a common fungal infection that can cause a red or silvery ring-like rash on the skin. Ringworm commonly affects arms and legs, but it can appear almost anywhere on the body. Despite its name, ringworm doesn’t have anything to do with worms.Other similar fungal infections can affect the scalp, feet, groin and nails. These fungal infections, medically known as ‘tinea’, are not serious and are usually easily treated. However, they are contagious and easily spread.There are different types of tinea fungal infection, based on the affected area of the body and those are athlete’s foot (tinea pedis),jock itch (tinea cruris) See your GP if you or your child has a fungal scalp infection, as it’s treated with antifungal tablets, which are only available on prescription. Symptoms of a fungal scalp infection include small patches of scaly scalp skin (which may be sore), patchy hair loss and itchiness.Fungal spores are passed between people through direct skin contact and by sharing objects such as towels, hairbrushes and bedding. Athlete’s foot is commonly spread in gym and swimming pool changing rooms.Most ringworm infections are mild and can be treated using a pharmacy antifungal cream. Scalp infections can be treated with antifungal tablets, sometimes combined with antifungal shampoo. If the skin is irritated or broken, it can lead to other bacterial infections, which may need treatment with antibiotics.  "],
     "context": [""]
    },
     {"tag": "query",
     "patterns": ["What is depression?","I am suffering from depression", "What are the symptoms of depression"," What are the remedies for depression?","What are the treatment for depression."],
     "responses": ["Everyone has spells of feeling down, but depression is more than just spending a few days feeling sad or unhappy. Depression can make you feel persistently sad and down for weeks or months at a time.While some people believe that depression is trivial or not a genuine health problem, it’s actually a real condition that affects around one in 10 people over the course of their lives. It impacts people of all genders and ages – including children. Studies show that around 4% of children in the UK between the ages of five and 16 are depressed or anxious.With the right support and treatment, most people recover fully from depression.Symptoms of depression can be very different from person to person. However, as a general rule, if you are depressed you feel hopeless, sad and lacking interest in things that used to make you feel happy. Depression symptoms are bad enough to interfere with work, social life and family life, and can persist for weeks or months.Doctors describe depression in one of three ways, depending on how serious it is:1-mild depression – it has some impact on daily life.2-moderate depression – it has a significant impact on your daily life, 3 severe depression – this makes it nearly impossible to get through your life day to day.A few people with severe depression may have symptoms of psychotic depression.Psychological depression symptoms include:continuous sadness or low mood,losing interest in things,losing motivation,not getting any enjoyment in life,feeling tearful,feeling guilty,feeling anxious,feeling irritable,finding it hard to make decisions,feeling intolerant of other people,feeling helpless Treatments for depression : There are a number of talking therapies for depression.1-Cognitive behavioural therapy (CBT).CBT helps you make sense of your thoughts and behaviour and the affect they have on you. Part of it’s recognising that past events may have played a part in making you who you are, but the main focus is changing how you feel, behave and think now.You can use CBT to learn how to overcome negative thoughts – this can help you to tackle feelings of hopelessness, for example.Most people have a course of six to eight CBT sessions that goes over 10 to 12 weeks. Sessions are one-to-one, between you and a CBT-trained counsellor. You might also be offered group CBT.2-Computerised CBT (CCBT):This type of CBT is done using a computer instead of face-to-face with the counsellor. It should be supported by a healthcare professional – your GP may prescribe it, and you might have to use the computer in the GP surgery to access it. CCBT involves a series of weekly sessions.3-Interpersonal Therapy (IPT):IPT is focused on your relationships with people around you, and problems that you might be having with them. These can include problems communicating, or dealing with a bereavement.There’s evidence that suggests IPT can be as effective for depression as CBT or medication, but more research needs to be done.4-Psychodynamic psychotherapy:This is also known as psychoanalytic psychotherapy. You’ll work with a therapist who encourages you to say whatever you’re thinking. This helps you to find hidden patterns and meanings in your words and behaviour that could be contributing to your depression.5-Counselling:Counselling is a type of therapy that works really well if you have good mental wellbeing overall but need help coping with a crisis that’s currently going on in your life. These can include anger, bereavement, infertility, relationship problems, job loss and serious illness.On the NHS, counselling usually takes place over six to 12 sessions, each an hour long. The sessions are confidential.A counsellor helps you to think about what’s going on in your life and find new ways of dealing with the problems. They’ll offer practical advice, support you, and help you find solutions, but they don’t tell you what to do."],
    "context": [""]
    }, 
 {"tag": "query",
 "patterns": ["What is diabetes?","I am suffering from diabetes", "What are the symptoms of diabetes"," What are the causes for diabetes?"],
 "responses": ["Diabetes is a lifelong condition that causes a person’s blood glucose (sugar) level to become too high.There are two main types of diabetes – type 1 diabetes ,type 2 diabetes.Type 2 diabetes is far more common than type 1. In the UK, around 90% of all adults with diabetes have type 2.There are 4.7 million people living with diabetes in the UK. That’s more than one in 15 people in the UK who has diabetes (diagnosed or undiagnosed). This figure has nearly trebled since 1996, when there were 1.4 million. By 2025, it is estimated that 5 million people will have diabetes in the UK.The main symptoms of diabetes are:feeling very thirsty, urinating more frequently than usual, particularly at night, feeling very tired,weight loss and loss of muscle bulk,itching around the penis or vagina, or frequent episodes of thrush,cuts or wounds that heal slowly,blurred vision.The amount of glucose in the blood is controlled by a hormone called insulin,which is produced by the pancreas (a gland behind the stomach).When food is digested and enters your bloodstream, insulin moves glucose out of the blood and into cells, where it’s broken down to produce energy.However, if you have diabetes, your body is unable to break down glucose into energy. This is because there’s either not enough insulin to move the glucose, or the insulin produced doesn’t work properly."],
 "context": [""]
 },
 {"tag": "query",
 "patterns": ["What is earwax buildup?","I am suffering from earwax buildup", "What are the symptoms of earwax buildup"," What are the causes for earwax buildup ?","What are the treatment for earwax buildup."],
 "responses": ["Earwax is produced inside your ears to keep them clean and free of germs. It usually passes out of the ears harmlessly, but sometimes too much can build up and block the ears. A build-up of earwax is a common problem that can often be treated using eardrops bought from a pharmacy.If pharmacy treatment doesn’t work, contact your GP practice. They may suggest having your ears washed out.If these treatments don’t help, your GP may refer you to an ear, nose and throat (ENT) department for specialised treatment.What can cause an earwax build-up?Some people regularly get blocked ears because they naturally produce a lot of earwax.Other factors that can increase the risk of too much earwax include:producing naturally hard or dry earwax,having narrow or hairy ear canals (the tube between the opening of the ear and the eardrum),being elderly, as earwax becomes drier with age,bony growths in the outer part of the ear canal,Earwax can also block your ear if you frequently insert objects into your ear canal, such as cotton buds, ear plugs or hearing aids.Symptoms of an earwax build-up:,earache,hearing loss,tinnitus (hearing sounds from inside your body),itchiness in or around the ear,vertigo (a spinning sensation),ear infections.What are the remedies for earwax built up is :Never try to remove a build-up of earwax yourself with your fingers, a cotton bud or any other object. This can damage your ear and push the wax further down.If the earwax is only causing minor problems, you can try buying some eardrops from a pharmacy. Using drops may make your hearing or symptoms a little worse at first before getting better. These can help soften the earwax so that it falls out naturally.There are several different types of eardrops you can use, including drops containing sodium bicarbonate, olive oil or almond oil.However, eardrops aren’t suitable for everyone and some can irritate the skin. For example, eardrops shouldn’t be used if you have a perforated eardrum (a hole or tear in your eardrum).The main treatments are:eardrops – drops used several times a day for a few days to soften the earwax so that it falls out by itself,ear irrigation – a quick and painless procedure where an electric pump is used to push water into your ear and wash the earwax out,microsuction – a quick and painless procedure where a small device is used to suck the earwax out of your ear,aural toilet – where a thin instrument with a small hoop at one end is used to clean your ear and scrape out the earwax,Not all these treatments are suitable for everyone. Your pharmacist or doctor can let you know what treatments may work for you and they can tell you about any associated risks or side effects "],
 "context": [""]
 },
 {"tag": "query",
 "patterns": ["What is fever?","I am suffering from fever", "What are the symptoms of fever","What are the treatment for fever."],
 "responses": ["A fever is a temporary rise in body temperature. It's one part of an overall response from the body's immune system. A fever is usually caused by an infection,For most children and adults, a fever may be uncomfortable. But it usually isn't a cause for concern. For infants, however, even a low fever may mean there's a serious infection.Fevers generally go away within a few days. A number of over-the-counter medications lower a fever. But you don't necessarily need to treat a fever if it's not causing discomfort.Symptoms:Body temperatures vary slightly from person to person and at different times of day. The average temperature has traditionally been defined as 98.6 F (37 C). A temperature taken using a mouth thermometer (oral temperature) that's 100 F (37.8 C) or higher is generally considered to be a fever.Depending on what's causing a fever, other fever signs and symptoms may include:Sweating,Chills and shivering,Headache,Muscle aches,Loss of appetite,Irritability,Dehydration,General weakness,Taking a temperature.To take a temperature, you can choose from several types of thermometers, including oral, rectal, ear (tympanic) and forehead (temporal artery) thermometers.Oral and rectal thermometers generally provide the most accurate measurement of core body temperature. Ear or forehead thermometers, although convenient, provide less accurate temperature measurements.In infants, a rectal temperature, if doable, is somewhat more accurate. When reporting a temperature to your health care provider, give both the reading and the type of thermometer used.When to see a doctor,Fevers by themselves may not be a cause for alarm — or a reason to call a doctor. Yet there are some circumstances when you should seek medical advice for your baby, your child or yourself.Infants and toddlers,A fever is a particular cause for concern in infants and toddlers. Call your baby's health care provider if your child is:Younger than 3 months old and has a rectal temperature of 100.4 F (38 C) or higher.Between 3 and 6 months old and has a rectal temperature higher than 102 F (38.9 C) or has a lower temperature but seems unusually irritable, sluggish or uncomfortable.Between 7 and 24 months old and has a rectal temperature higher than 102 F (38.9 C) that lasts longer than one day but shows no other symptoms. If your child also has other signs and symptoms, such as a runny nose, cough or diarrhea, you can call sooner Children .There's probably no cause for alarm if your child has a fever but is responsive. This means your child makes eye contact with you and responds to your facial expressions and to your voice. Your child may also be drinking fluids and playing.Call your child's health care provider if your child:Is listless, confused or has poor eye contact with you.Is irritable, vomits repeatedly, has a severe headache, sore throat, stomachache or other symptoms causing a lot of discomfort.Has a fever after being left in a hot car. Seek medical care immediately.Has a fever that lasts longer than three days.Has a seizure associated with the fever. Call 911 if the seizure lasts more than five minutes or your child doesn't recover quickly.Ask your child's health care provider for guidance in special circumstances, such as a child with immune system problems or with a preexisting illness.Adults Call your health care provider if your temperature is 103 F (39.4 C) or higher. Seek immediate medical attention if any of these signs or symptoms accompanies a fever:Severe headache,Rash,Unusual sensitivity to bright light,Stiff neck and pain when you bend your head forward,Mental confusion, strange behavior or altered speech,Persistent vomiting,Difficulty breathing or chest pain,Abdominal pain,Pain when urinating,Convulsions or seizures ,Causes:Typical body temperature is a balance of heat production and heat loss. An area in the brain called the hypothalamus (hi-poe-THAL-uh-muhs) — also known as your body's thermostat — monitors this balance. Even when you're healthy, your body temperature varies slightly throughout the day. It can be lower in the morning and higher in the late afternoon and evening.When your immune system responds to disease, the hypothalamus can set your body temperature higher. This prompts complex processes that produce more heat and restrict heat loss. The shivering you might experience is one way the body produces heat. When you wrap up in a blanket because you feel chilled, you are helping your body retain heat.Fevers below 104 F (40 C) associated with common viral infections, such as the flu, may help the immune system fight disease and are generally not harmful.Fever or elevated body temperature might be caused by:A viral infection,A bacterial infection,Heat exhaustion,Certain inflammatory conditions such as rheumatoid arthritis — inflammation of the lining of your joints (synovium),A cancerous (malignant) tumor,Some medications, such as antibiotics and drugs used to treat high blood pressure or seizures,Some immunizations, such as the diphtheria, tetanus and acellular pertussis (DTaP), pneumococcal or COVID vaccine,Complications,Children between the ages of 6 months and 5 years are at increased risk of a seizure that occurs during a fever (febrile seizure). About a third of the children who have one febrile seizure will have another one, most commonly within the next 12 months. A febrile seizure may involve loss of consciousness, shaking of limbs on both sides of the body, eyes rolling back or body stiffness. Although alarming for parents, the vast majority of febrile seizures cause no lasting effects. If a seizure occurs:Lay your child on the side or stomach on the floor or ground,Remove any sharp objects that are near your child,Loosen tight clothing,Hold your child to prevent injury,Don't place anything in your child's mouth or try to stop the seizure,Call 911 or your local emergency number if a seizure lasts more than five minutes or your child doesn't appear to recover well after the seizure,Get emergency room or urgent care services if it's your child's first febrile seizure.if your child doesn't need emergency care, see your child's health care provider as soon as possible for further evaluation.Prevention:You may be able to prevent fevers by reducing exposure to infectious diseases. Here are some tips that can help:Get vaccinated as recommended for infectious diseases, such as influenza and COVID-19.Follow public health guidelines for wearing masks and social distancing.Wash your hands often and teach your children to do the same, especially before eating, after using the toilet, after spending time in a crowd or around someone who's sick, after petting animals, and during travel on public transportation.Show your children how to wash their hands thoroughly, covering both the front and back of each hand with soap and rinsing completely under running water.Carry hand sanitizer with you for times when you don't have access to soap and water."],
 "context": [""]
 }, 
 {"tag": "query",
 "patterns": ["What is itching?","I am suffering from itching", "What are the symptoms of itching"],
 "responses": ["Itching is an unpleasant sensation that compels a person to scratch the affected area. The medical name for itching is pruritus.Itching can affect any area of the body. It can either be:generalised – where itching occurs over the whole body.localised – where itching only occurs in a particular area.Sometimes, there may be a rash or spot where the itching occurs.Mild, short-lived itching is common, but the problem can occasionally be severe and very frustrating to live with.Itching can be caused by a number of different conditions, including:skin conditions – such as eczema,allergies or skin reactions,parasitic infestations – such as scabies,insect bites and stings,fungal infections – such as athlete’s foot or vaginal thrush,hormonal changes during pregnancy or the menopause,symic conditions (one that affects the whole body) – such as liver or kidney problems, or an overactive thyroid gland"],
 "context": [""]
 },
       

{"tag": "query",
"patterns": ["I have acne ",
"I am suffering from acne ",
"What is acne",
"What are the symptoms of acne",
"What are remedies for acne","what are the causes of acne"],
"responses": ["Acne is a common skin condition that affects most people at some point. It causes spots, oily skin and sometimes skin that’s hot or painful to touch.Acne most commonly develops on the:face,back,chest.type :-blackheads,whiteheads,papules,nodules,cysts.remedies:-Apply Ice to the Pimple:Apply a Paste of Crushed Aspirin to the Pimple,Use An Over-the-Counter Acne Spot Treatment.Use Makeup with Salicylic Acid to Conceal Pimples.Apply a Face Mask for Acne.Get a Cortisone Injection to Quickly Get Rid of a Pimple.causes:-Acne is caused when tiny holes in the skin, known as hair follicles, become blocked.Sebaceous glands are tiny glands found near the surface of your skin. The glands are attached to hair follicles, which are small holes in your skin that an individual hair grows out of.Sebaceous glands lubricate the hair and the skin to stop it drying out. They do this by producing an oily substance called sebum.In acne, the glands begin to produce too much sebum. The excess sebum mixes with dead skin cells and both substances form a plug in the follicle.If the plugged follicle is close to the surface of the skin, it bulges outwards, creating a whitehead. Alternatively, the plugged follicle can be open to the skin, creating a blackhead.Normally harmless bacteria that live on the skin can then contaminate and infect the plugged follicles, causing papules, pustules, nodules or cysts."],
"context": [""]
}, 
{"tag": "query",
"patterns": ["I have allergy ",
"I am suffering from allergy ",
"What is allergy",
"What are the symptoms of allergy",
"What are remedies for allergy"],
"responses": ["An allergy is a reaction the body has to a particular food or substance.Allergies are very common. They’re thought to affect more than 1 in 4 people in the UK at some point in their lives.They are particularly common in children. Some allergies go away as a child gets older, although many are lifelong. Adults can develop allergies to things they weren’t previously allergic to.Having an allergy can be a nuisance and affect your everyday activities, but most allergic reactions are mild and can be largely kept under control. Severe reactions can occasionally occur, but these are uncommon.common allergies :-Substances that cause allergic reactions are called allergens. The more common allergens include:grass and tree pollen – an allergy to these is known as hay fever (allergic rhinitis),dust mites,animal dander (tiny flakes of skin or hair),food – particularly nuts, fruit, shellfish, eggs and cow’s milk,insect bites and stings,medication – including ibuprofen, aspirin, and certain antibiotics,latex – used to make some gloves and condom mould – these can release small particles into the air that you can breathe in household chemicals – including those in detergents and hair dyes.Most of these allergens are generally harmless to people who aren’t allergic to them.symptoms:-Symptoms of an allergic reaction usually develop within a few minutes of being exposed to something you’re allergic to, although occasionally they can develop gradually over a few hours.Although allergic reactions can be a nuisance and hamper your normal activities, most are mild. Very occasionally, a severe reaction called anaphylaxis can occur. "],
"context": [""]
},  
{"tag": "query",
"patterns": ["I have anxiety ",
"I am suffering from anxiety",
"What is anxiety ",
"I am felling anxiety",
"What are the symptoms of anxiety",
"What are remedies for anxiety","what are the causes of anxiety"],
"responses": ["Anxiety is a feeling of unease, like worry or fear, that can be mild or severe.Generalised anxiety disorder GAD is a long-term condition. It causes you to feel anxious about a wide range of issues, rather than 1 specific event.People with GAD feel anxious most days. They often struggle to remember the last time they felt relaxed.As soon as 1 anxious thought is resolved, another may appear about a different issue.Symptoms :-GAD can cause a change in your behaviour and the way you think and feel about things. It can also cause physical changes. This results in symptoms like:restlessness,a sense of dread feeling constantly “on edge”,difficulty concentrating,irritability,dizziness,tiredness,a noticeably strong, fast or irregular heartbeat >(palpitations),muscle aches and tension,trembling or shaking.The exact cause of GAD is not fully understood. It’s likely that a combination of several factors plays a role, like:overactivity in areas of the brain involved in emotions and behaviour,an imbalance of the brain chemicals serotonin and noradrenaline, which are involved in the control and regulation of mood,the genes you inherit from your parents – you’re estimated to be 5 times more likely to develop GAD if a close relative has it,having a history of stressful or traumatic experiences, like domestic violence, child abuse or bullying,having a painful long-term health condition, like arthritis,having a history of drug or alcohol misuse"],
"context": [""]
}, 
{"tag": "query",
"patterns": ["I have asthma ",
"I am suffering from asthma",
"What is asthma ",
"I am felling asthma",
"What are the symptoms of asthma",
"What are remedies for asthma"],
"responses": ["Asthma is a common long-term condition that can cause coughing, wheezing, chest tightness and breathlessness.The severity of these symptoms varies from person to person. Asthma can be controlled well in most people most of the time, although some people may have more persistent problems.Occasionally, asthma symptoms can get gradually or suddenly worse. This is known as an ‘asthma attack’, although doctors sometimes use the term ‘exacerbation’.Severe attacks may require hospital treatment and can be life threatening, although this is unusual.Symptoms of asthma:-The symptoms of asthma can range from mild to severe. Most people will only experience occasional symptoms, although a few people will have problems most of the time.The main symptoms of asthma are:wheezing (a whistling sound when you breathe),shortness of breath,a tight chest – which may feel like a band is tightening around it ,coughing.These symptoms are often worse at night and early in the morning, particularly if the condition is not well controlled. They may also develop or become worse in response to a certain trigger, such as exercise or exposure to an allergen.Speak to your GP if you think you or your child may have asthma. You should also talk to your doctor or asthma nurse if you have been diagnosed with asthma and you are finding it difficult to control the symptoms.Causes of asthma:-It’s not clear exactly what causes asthma, although it is likely to be a combination of factors.Some of these may be genetic. However, a number of environmental factors are thought to play a role in the development of asthma. These include air pollution, chlorine in swimming pools and modern hygiene standards (known as the ‘hygiene hypothesis’).There is currently not enough evidence to be certain whether any of these can cause asthma, although a variety of environmental irritants, such as dust, cold air and smoke, may make it worse. "],
"context": [""]
}, 
{"tag": "query",
"patterns": ["I have cervical cancer ",
"I am suffering from cervical cancer",
"What is cervical cancer ",
"I am felling cervical cancer",
"What are the symptoms of cervical cancer",
"What are remedies for cervical cancer"],
"responses": ["Cervical cancer is a type of cancer that develops in a woman’s cervix (the entrance to the womb from the vagina).Cancer of the cervix often has no symptoms in its early stages. If you do have symptoms, the most common is unusual vaginal bleeding, which can occur after sex, in between periods or after the menopause.Abnormal bleeding doesn’t mean that you definitely have cervical cancer, but it should be investigated by your GP as soon as possible. If your GP thinks you might have cervical cancer, you should be referred to see a specialist within 2 weeks.What causes cervical cancer?Almost all cases of cervical cancer are caused by the human papilloma virus (HPV). HPV is a very common virus that can be passed on through any type of sexual contact with a man or a woman.There are more than 100 different types of HPV, many of which are harmless. However, some types of HPV can cause abnormal changes to the cells of the cervix, which can eventually lead to cervical cancer.Two strains of the HPV virus (HPV 16 and HPV 18) are known to be responsible for 70% of all cases of cervical cancer. These types of HPV infection don’t have any symptoms, so many women won’t realise they have the infection.However, it’s important to be aware that these infections are relatively common and most women who have them don’t develop cervical cancer.Using condoms during sex offers some protection against HPV, but it can’t always prevent infection, because the virus is also spread through skin-to-skin contact of the wider genital area.Since 2008, a HIV vaccine has been routinely offered to girls aged 12 and 13.Who’s affected by cervical cancer?Following the success of the NHS Cervical Screening Programme and the early detection of cell changes, the number of cervical cancer cases in the UK has reduced. Around 3,000 cases of cervical cancer are diagnosed in the UK each year.It’s possible for women of all ages to develop cervical cancer, but the condition mainly affects sexually active women aged between 30 and 45. Cervical cancer is very rare in women under 25."],
"context": [""]
}, 
{"tag": "query",
"patterns": ["I have chest pain ",
"I am suffering from chest pain",
"What is chest pain ",
"I am felling chest pain",
"What are the symptoms of chest pain",
"What are remedies for chest pain"],
"responses": ["You or someone else has symptoms like:central chest pain or discomfort in the chest that doesn’t go away – it may feel like pressure, tightness or squeezing,pain that radiates down the left arm, or both arms, or to the neck, jaw, back or stomach,unconsciousnes,seizures or fitting,difficulty breathing (snoring or rasping),rapid heart beat,low or undetectable heart beat,chest pain and breathlessness, nausea, sweating or ~ coughing up blood.There are a number of different conditions that can cause chest pain. You should always seek medical advice to make sure you get a proper diagnosis.Depending on your symptoms and circumstances, you may need further investigation.Heart attack.Chest pain is more likely to be caused by a heart attack if it lastsmore than 15 minute.occurs while resting Chest pain caused by angina is usually triggered by physical activity (exertion). It usually gets better with rest after a few minutes.Pulmonary embolismLung conditions that can cause chest pain include:pneumonia – inflammation of the lungs (usually caused by an infection),pleurisy – inflammation of the membrane surrounding the lungs (usually caused by an infection),Conditions affecting the lungs can cause sharp chest pain that gets worse when you breathe in and out is accompanied by other symptoms like coughing or breathlessness If someone has severe pneumonia or pleurisy, they may also have symptoms like:rapid breathing,confusion"],
"context": [""]
}
]}
